In [2]:
# import libraries
import pandas as pd
import numpy as np
from datetime import date, timedelta

In [18]:
# import data
df_spray = pd.read_csv('./assets/spray.csv')

In [40]:
# check data
df_spray

            date      time   latitude  longitude
0     2011-08-29  18:56:58  42.391623 -88.089163
1     2011-08-29  18:57:08  42.391348 -88.089163
2     2011-08-29  18:57:18  42.391022 -88.089157
3     2011-08-29  18:57:28  42.390637 -88.089158
4     2011-08-29  18:57:38  42.390410 -88.088858
...          ...       ...        ...        ...
14830 2013-09-05  20:34:11  42.006587 -87.812355
14831 2013-09-05  20:35:01  42.006192 -87.816015
14832 2013-09-05  20:35:21  42.006022 -87.817392
14833 2013-09-05  20:35:31  42.005453 -87.817423
14834 2013-09-05  20:35:41  42.004805 -87.817460

[14835 rows x 4 columns]

In [19]:
# change all column names to lowercase
df_spray.columns = [x.lower() for x in df_spray.columns]

In [20]:
# convert date field to date
df_spray['date'] =  pd.to_datetime(df_spray['date'])

In [37]:
# check for duplicates by storing duplicates in a temp dataframe

df = pd.DataFrame()
df['duplicate'] = df_spray.duplicated()
df[df.duplicate==True]

      duplicate
485        True
490        True
491        True
492        True
493        True
...         ...
1025       True
1026       True
1027       True
1028       True
1029       True

[541 rows x 1 columns]

In [39]:
# remove duplicates
df_spray.drop_duplicates(inplace=True)

In [41]:
df_spray.shape

(14294, 4)

In [49]:
df_spray.dtypes

date         datetime64[ns]
time                 object
latitude            float64
longitude           float64
dtype: object

In [42]:
# check for null values

df_spray.isna().sum()

date           0
time         584
latitude       0
longitude      0
dtype: int64

### There are many null values for Time field, but since it is not needed for our analysis we will leave it alone

In [50]:
df_spray['date'].nunique()

10

In [43]:
# Check the dates and locations of spraying

df_spray.groupby('date').count()

            time  latitude  longitude
date
2011-08-29    95        95         95
2011-09-07   989      1573       1573
2013-07-17  2202      2202       2202
2013-07-25  1607      1607       1607
2013-08-08  1195      1195       1195
2013-08-15  2668      2668       2668
2013-08-16   141       141        141
2013-08-22  1587      1587       1587
2013-08-29  2302      2302       2302
2013-09-05   924       924        924

### Found 10 unique dates and locations that spraying was carried out

In [56]:
# save cleaned data
df_spray.to_csv('./assets/data_clean/spray_clean.csv', index=False)

In [57]:
# read cleaned data from csv
df_spray = pd.read_csv('./assets/data_clean/spray_clean.csv')